> Alternatively, what about using weighted Levenshtein distance to produce a best-effort diff? A heuristic diff like that would still be technically correct (as long as it still specified that the entire object will be recreated anyway), but much more useful than the status quo.

A crude beginning towards that direction:

```diff
diff --git a/internal/command/format/diff.go b/internal/command/format/diff.go
index 982b95980..39cd31034 100644
--- a/internal/command/format/diff.go
+++ b/internal/command/format/diff.go
@@ -882,6 +882,30 @@ func (p *blockBodyDiffPrinter) writeNestedBlockDiffs(name string, blockS *config
 			return 0
 		}
 
+		if len(oldItems) == len(newItems) {
+			// If the length is equal, assume there is a 1:1
+			// correspondence between items.
+			for i := 0; i < len(oldItems); i++ {
+				oldValue := oldItems[i]
+				newValue := newItems[i]
+				var action plans.Action
+				if !oldValue.IsKnown() || !newValue.IsKnown() {
+					action = plans.Update
+				} else if oldValue.Equals(newValue) == cty.True {
+					action = plans.NoOp
+				} else {
+					action = plans.DeleteThenCreate
+				}
+
+				path := append(path, cty.IndexStep{Key: oldValue})
+				skipped := p.writeNestedBlockDiff(name, nil, &blockS.Block, action, oldValue, newValue, indent, path)
+				if skipped {
+					skippedBlocks++
+				}
+			}
+			return skippedBlocks
+		}
+
 		allItems := make([]cty.Value, 0, len(oldItems)+len(newItems))
 		allItems = append(allItems, oldItems...)
 		allItems = append(allItems, newItems...)
@@ -1022,8 +1046,8 @@ func (p *blockBodyDiffPrinter) writeNestedBlockDiff(name string, label *string,
 	}
 
 	p.buf.WriteString("\n")
-	p.buf.WriteString(strings.Repeat(" ", indent))
-	p.writeActionSymbol(action)
+	p.buf.WriteString(strings.Repeat(" ", indent-2))
+	p.buf.WriteString(p.color.Color(DiffActionSymbol(action)) + " ")
 
 	if label != nil {
 		fmt.Fprintf(p.buf, "%s %q {", name, *label)
```

It solves the specific problem at hand, and this now causes Terraform to produce a much nicer diff:

```
Terraform will perform the following actions:

  # google_access_context_manager_service_perimeters.service-perimeters must be replaced
-/+ resource "google_access_context_manager_service_perimeters" "service-perimeters" {
      ~ id     = "accessPolicies/123456789012/servicePerimeters" -> (known after apply)
        # (1 unchanged attribute hidden)
    -/+ service_perimeters { # forces replacement
          + create_time               = (known after apply)
            name                      = "accessPolicies/123456789012/servicePerimeters/my_project"
          ~ title                     = "my_project" -> "my-project
          + update_time               = (known after apply)
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }
```

BTW, I noticed that there is apparently precedent for doing this kind of best-effort diff:

https://github.com/hashicorp/terraform/blob/05f21cdff8c85bd31f2bb36c524ce9f799e0e2fa/internal/command/format/diff.go#L1208-L1211